데모 영상

영상과 이미지 데스모스같은 인터랙티브 수업의 차이



2디 그래프
미적분
삼각함수
음함수

카메라 움직이기


선형대수학
벡터 기본
트랜스폼
행렬

벡터필드
유체역학




테일러 급수
편미분
푸리에 변환
마님 물리엔진
스파이노그래프



'아비트라지를 설명하고 마치겠습니다#1'
'수익이라는 것은 기본적으로 시장의 비효율성이나 에러를 이용하는 것입니다#1'
'그리고 시장이 많으면 많을수록 그런 기회가 많아지기에 덱스를 마다할 이유는 없습니다#1'
'아비트라지란 한국어로 재정거래라고 불리고 두 개의 시장 사이이서 가격차가 발쌩하면#1'
'그 차익을 노리고 거래하는 것입닏#1'
'싼데서 사서 비싼데 팔기에 보따리장사라고도 부릅니다. #1'
'지금 덱스 에이에서 비트코인이 500달러 덱스 비에서 470달러인 상황을 가정합니다#1'
'덱스비에서 사서 바로 덱스 에이에 팔면 이득을 얻을 수 있습니다#1'

'그러나 고려할 것들이 있습니다#1'
'1덱스 비에서 비트코인을 구매하면 수수료를 내고 비티씨 가격변동에 노출이 됩니다#1'
'1혹시나 다른 중앙화 거래소로 옮긴다면 비싼 전송수수료도 들 것이고, #1'
'블록체인 처리시간과 중앙화 거래소의 자체 서버 처리시간에 거래수수료도 지불합니다#1'
'다른 덱스로 옮긴다면 전송수수료와 블록체인 상 처리시간 비싼 거래수수료도 지불합니다#1'
'1다른 블록체인으로 브릿지를 해도 비싼 브릿지 수수료가 들것이고 시간도 더 걸립니다#1'
'1각거래마다 슬리피지도 발생할 ㅜㅅ 있ㅇ습니다#1'
'성공할지 안 할지 보장도 없구요 이 모든 것을 계산하고도 남는 장사라고 생각하면 아비트라지를 하는 것입니다#1'
'보통은 미세한 차이를 보고 하기 때문에 규모가 커야지 수익이 좀 남는 편이고#1'
'얼핏보면 하는 거 없이 돈 버는 것 같지만#1'
'생각보다 리스크가 있고 인간의 손으로 하기에는 24시간 못 하고 너무 느려서#1'
'보통 컴퓨터로 봇을 만ㄷ르어 돌리게 됩니다.#1'

'아비트라지가 매우 중요한 이유는 코인 가격을 맞춰주고 안정화 하기 때문입니다#1'
'여러분이 사용하는 거래소의 가격이 싸면 좋겠지만 만약 이상하게 비싼 상태로 유지되고 있다면#1'
'당연히 코인을 사는데 불리한 상황이겠지만 곧 아비트라저들의 와서 모든 시장의 가격의 평형을 이루게 합니다#1'
'수많은 거래소 사이에서 이 아비트라지 봇들이 코인을 사고 팔며 가격을 전부 똑같이 맞춰주고#1'
'그래서 우리는 어느 거래소든 다 비슷한 가격을 보게 됩니다.#1'
'마찬가지로 덱스에서 내가 최초로 풀을 만들 때 말도안 되는 가격으로 만든다는 상상을 할 수도 있습니다#1'
'내가 비트코인이 비싸지길 바라면서 10비트와 5000테더를 넣으면 그 순간 1비트의 가격은 500테더입니다#1'
'곧 아비트라저들이 와서 시장가격으로 맞춰줍니다. #1'
'덱스도 중앙화거래소에 영향을 주고 중앙화 거래소도 덱스에 영향을 줍니다#1'
'모든 거래소가 아비트라지 봇으로 묶여있어 서로가 서로에게 영향을 줍니다.#1'
'아비트라지도 금융 생태계를 이루는 중요한 요소 중 하나이므로 잘 이해하고 있어야합니다#1'



















# TODO 5.618 secs다른 덱스로 옮긴다면 전송수수료와 블록체인 상 처리시간 비싼 거래수수료도 지불합니다

# TODO 0:01:01.137  ~  0:01:06.755

# TODO 1.0secs pause

# TODO 0:01:06.755  ~  0:01:07.755



# TODO 5.424 secs다른 블록체인으로 브릿지를 해도 비싼 브릿지 수수료가 들것이고 시간도 더 걸립니다

# TODO 0:01:07.755  ~  0:01:13.179

# TODO 1.0secs pause

# TODO 0:01:13.179  ~  0:01:14.179



# TODO 2.888 secs각거래마다 슬리피지도 발생할 수도 있습니다

# TODO 0:01:14.179  ~  0:01:17.067

# TODO 1.0secs pause

# TODO 0:01:17.067  ~  0:01:18.067



# TODO 6.512 secs성공할지 안 할지 보장도 없구요 이 모든 것을 계산하고도 남는 장사라고 생각하면 아비트라지를 하는 것입니다

# TODO 0:01:18.067  ~  0:01:24.579

# TODO 1.0secs pause

# TODO 0:01:24.579  ~  0:01:25.579



# TODO 14.449 secs보통은 미세한 차이를 보고 하기 때문에 규모가 커야지 수익이 좀 남는 편이고, 얼핏보면 하는 거 없이 돈 버는 것 같지만 생각보다 리스크가 있고 인간의 손으로 하기에는 24시간 못 하고 너무 느려서 보통 컴퓨터로 봇을 만들어 돌리게 됩니다

# TODO 0:01:25.579  ~  0:01:40.028

# TODO 1.0secs pause

# TODO 0:01:40.028  ~  0:01:41.028



# TODO 4.349 secs아비트라지가 중요한 이유는 코인 가격을 맞춰주고 안정화 하기 때문입니다

# TODO 0:01:41.028  ~  0:01:45.377

# TODO 1.0secs pause

# TODO 0:01:45.377  ~  0:01:46.377



# TODO 12.105 secs여러분이 사용하는 거래소의 가격이 싸면 좋겠지만 만약 이상하게 비싼 상태로 유지되고 있다면 당연히 코인을 사는데 불리한 상황이겠지만 곧 아비트라저들의 와서 모든 시장의 가격의 평형을 이루게 합니다

# TODO 0:01:46.377  ~  0:01:58.482

# TODO 1.0secs pause

# TODO 0:01:58.482  ~  0:01:59.482



# TODO 9.218 secs수많은 거래소 사이에서 이 아비트라지 봇들이 코인을 사고 팔며 가격을 전부 똑같이 맞춰주고 그래서 우리는 어느 거래소든 다 비슷한 가격을 보게 됩니다.

# TODO 0:01:59.482  ~  0:02:08.700

# TODO 1.0secs pause

# TODO 0:02:08.700  ~  0:02:09.700



# TODO 6.27 secs마찬가지로 덱스에서 내가 최초로 풀을 만들 때 말도안 되는 가격으로 만든다는 상상을 할 수도 있습니다

# TODO 0:02:09.700  ~  0:02:15.970

# TODO 1.0secs pause

# TODO 0:02:15.970  ~  0:02:16.970



# TODO 6.693 secs내가 비트코인이 비싸지길 바라면서 10비트와 5000테더를 넣으면 그 순간 1비트의 가격은 500테더입니다

# TODO 0:02:16.970  ~  0:02:23.663

# TODO 1.0secs pause

# TODO 0:02:23.663  ~  0:02:24.663



# TODO 8.13 secs곧 아비트라저들이 와서 시장가격으로 맞춰줍니다.덱스도 중앙화거래소에 영향을 주고 중앙화 거래소도 덱스에 영향을 줍니다

# TODO 0:02:24.663  ~  0:02:32.793

# TODO 1.0secs pause

# TODO 0:02:32.793  ~  0:02:33.793



# TODO 4.615 secs모든 거래소가 아비트라지 봇으로 묶여있어 서로가 서로에게 영향을 줍니다

# TODO 0:02:33.793  ~  0:02:38.408

# TODO 1.0secs pause

# TODO 0:02:38.408  ~  0:02:39.408



# TODO 5.134 secs아비트라지도 금융 생태계를 이루는 중요한 요소 중 하나이므로 잘 이해하고 있어야합니다

# TODO 0:02:39.408  ~  0:02:44.542

# TODO 1.0secs pause

# TODO 0:02:44.542  ~  0:02:45.542


