데모 영상

영상과 이미지 데스모스같은 인터랙티브 수업의 차이



2디 그래프
미적분
삼각함수
음함수

카메라 움직이기


선형대수학
벡터 기본
트랜스폼
행렬

벡터필드
유체역학




테일러 급수
편미분
푸리에 변환
마님 물리엔진
스파이노그래프


it is empty text
Creating concated file
# TODO 5.69 secs중앙화 거래소는 사람들은 원자재나 주식 등 무언가를 편하게 거래하기 위해서 탄생했습니다
# TODO 0:00:24.080  ~  0:00:29.770
# TODO 1.0secs pause
# TODO 0:00:29.770  ~  0:00:30.770

# TODO 11.61 secs단순히 개인 대 개인으로 거래를 하려면 거래대상을 직접 찾기 힘들었고, 그 자리에서 일어나는 교환의 형태면 자리에 있는 동안만
#  상대방을 찾을 수 있고 예약 등의 형태로 거래하기가 어려웠습니다
# TODO 0:00:30.770  ~  0:00:42.380
# TODO 1.0secs pause
# TODO 0:00:42.380  ~  0:00:43.380

# TODO 13.76 secs그래서 모두가 통일된 규격으로 거래하고 일방적 계약파기의 위험을 없애고, 내가 자고 있어도 예약된 주문이 가능하게 하는 등 다
#  양한 편의를 위해 거래자 사이에 제3자인 거래소가 등장하고 거래소가 거래를 중개하기 시작했습니다
# TODO 0:00:43.380  ~  0:00:57.140
# TODO 1.0secs pause
# TODO 0:00:57.140  ~  0:00:58.140


'안녕하십니까. 디파이를 알아보는 디파이 시리즈 첫번째 강의입니다#1'
'디파이를 제대로 이해하기 위해서는 씨파이부터 이해할 필요가 있습니다#1'
'디파이가 나오게 된 배경에는 씨파이에 대한 불만이 있었기 때문입니다#1'
'디파이는 디센트럴라이즈드 파이낸스의 줄임말입니다#1'
'탈중앙화 거래소가 있다는 것은 이전에 중앙화된 거래소도 있었다 뜻입니다#1'
'중앙화 거래소의 탄생은 단순합니다.기존의 원자재나 주식, 채권, 선물 옵션 등, 무언가를 거래하기 위해 사랆들이 모였습니다 '
'단순히 개인 대 개인으로 거래를 하려면 거래대상을 찾기 힘들었고, 그 자리에서 일어나는 물물교환의 형태면 자리에 있는 동안만 상대방을 찾을 수 있고 예약 등의 형태로 거래하기가 어려웠습니다#1'
'그래서 모두가 통일된 규격으로 거래하고 일방적 계약파기의 위험을 없애고, 내가 자고 있어도 예약된 주문이 가능하게 하는 등 다양한 편의를 위해 거래자 사이에 제3자인 거래소가 등장하고 거래소가 거래를 중개하기 시작했습니다#1'
'################################################################################################################1'


'중앙화 거래소가 어떻게 작동하는지 예를 보겠습니다. 우리가 관심있는 건 크립토니까 일반적인 크립토 거래소를 기준으로 설명하겠습니다#1'

'에이는 비트코인을 가지고 있습니다#1'
'비는 현금을 가지고 있습니다#1'
'에이는 비트코인을 현금으로 바꾸고 싶고, 비는 현금으로 비트코인을 구매하고 싶습니다#1'

'그리하여 에이와 비는 거래소로 자신의 자산인 비트코인과 현금을 각각 입금합니다#1'
'거래소는 현금을 받기위해 시중은행 계좌나 결제시스템을 통하고 입금을 확인한 뒤 자신의 데이터베이스에 기록합니다#1'
'거래소 데이터베이스에 비의 현금 보유액이 업데이트 됐습니다#1'
'그리고 비트코인을 입금받기 위해서는 에이에게서 비트코인을 받기위한 주소를 에이에게 알려주고 에이가 그 주소로 비트코인을 전송하면 확인한 뒤 거래소의 데이터베이스에 기록합니다#1'
'거래소 데이터 베이스에 에이의 비트코인 보유액이 업데이트 됐습니다#1'

'거래소 앱에서 자신의 재산을 확인한 에이와 비는 이제 시장으로 갑니다. 여기서 시장은 물리적인 진짜 시장이 아니라 거래가 일어나는 디지털 공간을 의미합니다#1'
'보통 이것을 거래쌍 영어로는 페어라고 부릅니다#1'
'페어를 표시할 때는 보통 슬래시나 대시를 사용하거나 그냥 티커를 붙여서 표시하기도 합니다#1'
'그리고 일반적으로 왼쪽의 자산을 베이스 에셋 오른쪽을 쿼트 에셋이라고 부릅니다#1'
'뜻은 이 거래쌍에서 가격이란 것은 베이스에셋의 가치를 쿼트 에셋으로 표현한다는 것입니다#1'
'비티씨원화 거래쌍의 가격이 현재 50000000이라면 현재 비티씨는 50000000원이라는 것입니다#1'
'심볼처럼 말그대로 1베이스 에셋을 얻으려면 얼마나 많은 쿼트 에셋을 줘야하는지를 표시하는 것입니다#1'
'일반적인 주식 어플에서는 베이스 에셋과 쿼트 에셋을 생각해본 적이 없을 겁니다#1'
'어차피 전부 쿼트에셋으로 원화만 사용하기 때문에 거래쌍이라는 개념보다는 주식쇼핑같은 느낌입니다#1'
'하지만 외환시장, 즉 FOREX를 겪어보신 분이면 달러 엔, 유로 달러등의 거래쌍을 보셨을 겁니다#1'
'크립토 마켓도 특정 코인을 사기위해서 비트코인이나 이더리움을 지불하는 경우도 많고, 스테이블 코인만 해도 종류가 여러가지여서 거래쌍 개념이 더 절실히 다가옵니다#1'
'주식에서는 1 현대차가 3 삼성전자 이런 식으로 표현하지 않지만 크립토마켓에서는 1이더리움은 0.1비티씨, 1폴카닷은 0.01이더리움과 같은 표현이 많이 나옵니다#1'

'여기서 베이스 에셋이 이더라고 비티씨를 가지고 이더를 사기만 할 수 있는게 아니라 당연히 양방향 거래가 가능합니다#1'
'다만 보통 사람들이 더 많이 사용하는 자산을 가치의 척도로 보기 편하기 때문에 쿼트 에셋으로는 스테이블 코인, 법정통화, 비티씨, 이더리움 등이 많이 사용됩니다#1'


'이건 우리가 알고있는 주식이나 외환시장에도 적용되지만 크립토간의 거래쌍에도 많이 사용됩니다#1'
'이더 비티씨가 0.1이라면 이더를 1개사는데 비티씨가 0.1개 필요하다는 것입니다.#1'
'################################################################################################################1'


'참고로 거래소에서 은행계좌가 연동됐다면 법정통화를 사용하고 그렇지 못 하면, 보통 스테이블 코인을 사용하게 됩니다#1'
'스테이블 코인은 예를 들어 실제 코인을 보증하는 법정통화를 바탕으로 발행하고 1대1로 교환될 수 있는 코인을 말합니다#1'
'테더를 예로 들자면 1테더를 발행하기 위해서는 1달러를 담보로 맡겨야하고 다시 1테더를 가져가면 1달러를 돌려받을 수 있습니다#1'
'이렇게 법정통화를 스테이블 코인으로 만들면 비트코인을 들고 있는 것처럼 변동성에도 노출이 안 되고 현금과 같은 가치를 지닌 자산을 어느나라 거래소든 지갑이든 자유롭게 이동할 수 있어 많이 사용합니다#1'

'################################################################################################################1'

'거래쌍을 다루기에 가격이라는 개념도 정확히 하고 가겠습니다.#1'

'가격이라는 것에 대해 정확하게 정의하고 가겠습니다#1'
'가격은경제,비즈니스면에서 물건,용역,자산의 금전적 수적가치를 따지는 것이다. 값,가액이라고도 한다#1'
'한 제품 및 서비스의 가격이란 소비자가 그 제품이나 서비스를 한 단위로 구매하기 위해 지불해야 하는 화폐의 양을 말한다#1'

'가격이란 것은 한 제품 및 서비스를 한 단위로 구매하기 위해 지불해야하는 화폐의 양입니다#1'
'비티씨 테더 페어에서 38000테더라고 적혀있다면 있다면 우리는 비티씨의 가격이 얼마라고 얘기합니까#1'
'38000달러라고 부릅니다. 그러나 이는 엄밀하게 보면 틀린 표현입니다#1'
'비티씨의 가격은 38000테더입니다. 테더와 달러는 다른 것입니다 #1'
'달러는 달러 그자체이고 테더는 이 달러를 담보로 발행했기에 테더 회사가 도망가면 테더는 디지털 쓰레기가 됩니다#1'
'달러를 옹호하는 건 아닙니다. 미국정부가 망하면 달러는 종이 쓰레기가 됩니다#1'
'테더는 실제로 거래해보면 보통 0.999에서 1.001 "달러"사이를 움직이며 거래되ㅃ니다.#1'
'테더는 달러가 아닙니다. 다른 스테이블 코인도 마찬가지이구요#1'
'마치 금본위제 시절에 달러가 금이랑 같다고 여기는 것과 같습니다#1'
'달러는 금이 아니고 금에 대한 보증서 개념이었고 달러가 금이 되기 위해서는 추가적으로 달러지폐를 금으로 교환하는 과정을 거쳐야 했습니다#1'
'지금까지의 얘기는 무의식적으로 달러와 테더가 같다고 여겨지는 생각을 없애기 위함이고 이것은 나중에 논스테이블 페어를 이해하는데 도움이 됩니다.#1'

'어쨌든 가격이란것은 단위 화폐에 따라 결정이 되는 것이고, 단위가 없는 무차원 수같은 것이 아닙니다#1'
'1비트코인은 5000만원 40000달러라고 부르지 500000000이나 40000이라고만 부르지 않습니다#1'

'가격은 어떻게 움직일까요#1'
'우리가 배우기로는 수요와 공급이 교차하는 지점에서 결정된다고 배웁니다#1'
'그러나 거래소에서의 가격은 그 말보다는 인내심이 더 부족한 쪽에 의해 결정된다고 하는게 이해하기 쉬울겁니다#1'
'누구나 더 높은 가격에 팔고 더 낮은 가격에 사고 싶기 때문에 호가창에는 지정가 주문들이 쌓이기 시작합니다#1'
'그렇게 지정가 주문들이 현재가 위 아래로 계속 쌓이기만 하면 가격은 움직이지 않습니다 #1'
'실제로 호가창에 100원과 101원이 맞닿아 있고 아무도 시장가 주문을 넣지 않으면 가격은 마지막 주문이 100원에서 매수였으면 100원 101원에서 매도였으면 101원에 정지해있습니다#1'
'그러다가 누군가 기다림을 참지 못하고 시장가로 구매를 하면 호가창에 쌓여있던 물량이 시장가로 소화되면서 가격은 움직입니다 #1'
'잘 생각해보면 모든 사람이 지정가 주문만 넣으면 아무 일도 일어나지 않고 모두 기다리기만 합니다#1'


'################################################################################################################1'
'이제 에이와 비는 본격적으로 주문을 넣기 시작합니다#1'
'거래소에서 주문을 넣는 것에 대해서도 알고 가야할 게 있습니다#1'
'거래소에서 넣는 주문은 크게 두 가지가 있습니다#1'
'리밋 주문과 마켓 주문이고 한국어로는 지정가 주문 시장가 주문이라고 부릅니다#1'
'이전에 들어본 스톱오더 트레일링오더 같은 것은 이 주문 종류에 추가 기능을 넣은 것입니다#1'
'지정가 주문은 말그대로 가격을 지정해놓는 주문이고 시장가 주문은 우리가 회를 먹을 때 싯가라고 부르듯이 그냥 그 자리에서 체결하는 주문입니다#1'


'리밋 주문에 대해서는 일반적으로 알고 있는 가격을 지정해서 주문하는 그 개념이 맞고 마켓 주문에 대해서 설명하자면 마켓주문 가격을 입력하지 않습니다#1'
'왜냐하면 그냥 바로 구매할 수 있는대로 구매하는 주문이기 때문입니다#1'
'마켓주문은 묻지도 따지지도 않고 현재 바로 살 수 있는 만큼 삽니다#1'
'################################################################################################################1'

'거래소의 창을 보다보면 가격이 100원 101원을 마구마구 왔다 갔다 하는 것을 봅니다#1'
'그리고 유심히 봤다면 어떤 거래소는 미세하게 다른 가격 2개가 표시되는 경우도 있습니다#1'
'거래소에 두개의 가격이 잇다면 보통 큰 글자나 더 잘보이게 한 가격을 거래가라고 부르고 작은 것을 시장가라고 부릅니다#1'
'단어예 약간 혼동이 있을 수 있는데 영어로는 last price와 mark price 라고 부릅니다#1'
'라스트 프라이스는 말그대로 가장 마지막에 주문이 체결된 가격이고, 마크 프라이스는 보통 규모가 큰 거래소에 거래량 가중치를 계산한 평균가격을 얘기합니다#1'
'한 거래소에서 갑작스럽게 큰 거래가 일어나서 그 거래소에서만 가격이 떨어지면 마크 프라이스는 그만 큼 떨어지지 않습니다#1'
'다른 거래소에서는 같은 하락이 이루어지지 않았고 그래서 평균치가 그렇게 내려가지 않았기 때문입니다#1'
'이 마크 프라이스는 나중에 보게될 선물의 청산을 위해 사용되는 경우가 많습니다#1'
'정리하자면 반짝반짝하면서 변하는 가격은 라스트 프라이스고 마크 프라이스는 당장은 알 필요가 없습니다#1'
'참고로 현재 가격이 100달러인데 150달러에 리밋 주문을 넣으면 일반적으로 거래소에서는 안전장치가 있어서 실수로 인지하고 그냥 마켓가로 넣어서 100달러에서 가장 가까운 지정가 매도 물량을 구매하게 됩니다#1'
'################################################################################################################1'
'지겹지만 실제 사례로 넘어가기 전 슬리피지에 대해서 알아보고 가겠습니다#1'
'100원에 지정가 매수 주문이 20개 #1'
'200원에 지정가 매수 주문이 10개 #1'
'300원에 지정가 매도 주문이 10개 #1'
'400원에에 지정가 매도 주문이 20개있는 상태입니다#1'
'갑자기 새로운 누군가 600원을 시장가로 매수할 경우 200원에 있던 10개 중 2개가 체결이됩니다#1'
'이 경우 매수를 하기 때문에 매수를 주문하는 사람은 원화를 들고 일반적으로 쿼트 에셋인 원화를 입력해 주문을 넣으나 베이스 에셋을 입력하면 거래소 앱이 자동으로 해당하는 만큼의 베이스  에셋을 구매할 때까지 원화를 소모하며 구매합니다#1'
'방금과 같은 경우에는 btc2개를 시장가 매수해도 같은 결과가 일어납니다#1'
'누군가 6개를 시장가로 매도할 경우 100원에 쌓여있던 10개 중 6개가 체결됩니다#1'
'마찬가지로 쿼트 에셋인 원화를 매도주문에 입력해도 거래소 앱에서 알아서 입력한 원화를 얻을 때까지 가지고 있는 베이스 에셋을 매도합니다#1'

'그러나 만약 가장 가까이 있는 호가창의 물량보다 큰 물량을 주문하면 어떻게 될까요#1'
'마켓주문은 반드시 발생한 즉시 목표를 달성하려고 하기 때문에 가장 가까운 호가창의 물량을 다 삼키도고 목표 달성을 못 하면 다음 호가창으로 넘어가서 체결되기 시작합니다#1'

'예를 들어 비티씨를 25개 시장가로 매수하면 당장 300원에 있는 비티씨들 10개를 매수하고 그 다음은 400원에 걸린 15개를 매수합니다#1'
'그래서 총 소비한 비용은 300원 곱하기 25개인 7500이 아니라 300곱하기 10 더하기 400곱하기 15 총 9000원이 됩니다#1'
'여기서 슬리피지란 내가 주문을 넣을 때 기대하는 가격과 실제 평균 체결가의 차입니다#1'
'주문을 넣을 때는 300원을 보고 300원에 25개가 체결되는 것을 기대했지만 실제로는 25개를 구입하느데 총 9000원을 소비했기 때문에 9000나누기 25인 360원이 평균가격이고 60원의 슬리피지가 발생했다고 합니다#1'
'이 가격차인 슬리피지에 따른 비용으로 9000원 빼기 7500원인 1500원이 발생한 것입니다#1'

'슬리피지는 단순히 호가창의 물량으로만 설명되는 것이 아니고 주문을 넣은 뒤 결과적으로 내가 받게되는 영향입니다#1'
'즉 내가 주문을 넣고 그 사이에 시장 상황이 변동해서 영향을 받을 수도 있습니다#1'
'각 컴퓨터의 네트워크 상태나 서버상태 등도 슬리피지에 영향을 줄 수 있습니다#1'

'################################################################################################################1'
'이제 실제 에이비가 주문을 넣는것으로 더 자세히 알아보겠습니다#1'
'에이는 비트코인을 삐싸계 팔고싶어하고, 비는 비트코인을 싸게 사고 싶어합니다#1'
'현재 거래쌍에 보이는 가격은 1억원입니다#1'
'그래서 에이는 비트코인을 400에 판매하는 매도 지정가주문을 넣고 삐는 100만원에 매수 주문을 넣습니다.#1'
'그러나 가격이 지정가까지 올 생각을 안 하자 둘은 현재가에 더 가깝게#1'
'주문을 수정해 에이는 300에 매도, 비는 200원에 매수 주문을 넣습니다.#1'
'여전히 가격 안 움직이고 비트코인을 너무 사고 싶었던 에이는 시장가 주문을 하면서 비에게 비트코인을 구매합니다.#1'
'기분이 좋아진 비는 어디서 들었는지 개인지갑에 비트코인을 보관해야된다는 애기가 기억나 비트코인 지갑 어플을 받아 개인지갑을 만들고 거래소에 그 주소로 출금을 요청합니다#1'
'거래소는 비의 요청을 확인하고 거래소의 지갑에서 블록체인상으로 에이의 요청 주소로 비트코인을 전송하고 거래소 데이터베이스에서 비의 비트코인 보유액을 차감합니다.#1'
'에이는 비트코인으로 테슬라를 사려 했지만 구매가 막혀 비트코인을 팔아 마련한 원화로 테슬라를 사기위해 출금을 하려합니다#1'
'마찬가지로 거래소에 출금을 요청하고 거래소는 에이가 등록한 은행 계좌로 원화를 송금하고 데이터베이스에서 원화 보유액을 차감합니다#1'














# TODO 5.618 secs다른 덱스로 옮긴다면 전송수수료와 블록체인 상 처리시간 비싼 거래수수료도 지불합니다

# TODO 0:01:01.137  ~  0:01:06.755

# TODO 1.0secs pause

# TODO 0:01:06.755  ~  0:01:07.755



# TODO 5.424 secs다른 블록체인으로 브릿지를 해도 비싼 브릿지 수수료가 들것이고 시간도 더 걸립니다

# TODO 0:01:07.755  ~  0:01:13.179

# TODO 1.0secs pause

# TODO 0:01:13.179  ~  0:01:14.179



# TODO 2.888 secs각거래마다 슬리피지도 발생할 수도 있습니다

# TODO 0:01:14.179  ~  0:01:17.067

# TODO 1.0secs pause

# TODO 0:01:17.067  ~  0:01:18.067



# TODO 6.512 secs성공할지 안 할지 보장도 없구요 이 모든 것을 계산하고도 남는 장사라고 생각하면 아비트라지를 하는 것입니다

# TODO 0:01:18.067  ~  0:01:24.579

# TODO 1.0secs pause

# TODO 0:01:24.579  ~  0:01:25.579



# TODO 14.449 secs보통은 미세한 차이를 보고 하기 때문에 규모가 커야지 수익이 좀 남는 편이고, 얼핏보면 하는 거 없이 돈 버는 것 같지만 생각보다 리스크가 있고 인간의 손으로 하기에는 24시간 못 하고 너무 느려서 보통 컴퓨터로 봇을 만들어 돌리게 됩니다

# TODO 0:01:25.579  ~  0:01:40.028

# TODO 1.0secs pause

# TODO 0:01:40.028  ~  0:01:41.028



# TODO 4.349 secs아비트라지가 중요한 이유는 코인 가격을 맞춰주고 안정화 하기 때문입니다

# TODO 0:01:41.028  ~  0:01:45.377

# TODO 1.0secs pause

# TODO 0:01:45.377  ~  0:01:46.377



# TODO 12.105 secs여러분이 사용하는 거래소의 가격이 싸면 좋겠지만 만약 이상하게 비싼 상태로 유지되고 있다면 당연히 코인을 사는데 불리한 상황이겠지만 곧 아비트라저들의 와서 모든 시장의 가격의 평형을 이루게 합니다

# TODO 0:01:46.377  ~  0:01:58.482

# TODO 1.0secs pause

# TODO 0:01:58.482  ~  0:01:59.482



# TODO 9.218 secs수많은 거래소 사이에서 이 아비트라지 봇들이 코인을 사고 팔며 가격을 전부 똑같이 맞춰주고 그래서 우리는 어느 거래소든 다 비슷한 가격을 보게 됩니다.

# TODO 0:01:59.482  ~  0:02:08.700

# TODO 1.0secs pause

# TODO 0:02:08.700  ~  0:02:09.700



# TODO 6.27 secs마찬가지로 덱스에서 내가 최초로 풀을 만들 때 말도안 되는 가격으로 만든다는 상상을 할 수도 있습니다

# TODO 0:02:09.700  ~  0:02:15.970

# TODO 1.0secs pause

# TODO 0:02:15.970  ~  0:02:16.970



# TODO 6.693 secs내가 비트코인이 비싸지길 바라면서 10비트와 5000테더를 넣으면 그 순간 1비트의 가격은 500테더입니다

# TODO 0:02:16.970  ~  0:02:23.663

# TODO 1.0secs pause

# TODO 0:02:23.663  ~  0:02:24.663



# TODO 8.13 secs곧 아비트라저들이 와서 시장가격으로 맞춰줍니다.덱스도 중앙화거래소에 영향을 주고 중앙화 거래소도 덱스에 영향을 줍니다

# TODO 0:02:24.663  ~  0:02:32.793

# TODO 1.0secs pause

# TODO 0:02:32.793  ~  0:02:33.793



# TODO 4.615 secs모든 거래소가 아비트라지 봇으로 묶여있어 서로가 서로에게 영향을 줍니다

# TODO 0:02:33.793  ~  0:02:38.408

# TODO 1.0secs pause

# TODO 0:02:38.408  ~  0:02:39.408



# TODO 5.134 secs아비트라지도 금융 생태계를 이루는 중요한 요소 중 하나이므로 잘 이해하고 있어야합니다

# TODO 0:02:39.408  ~  0:02:44.542

# TODO 1.0secs pause

# TODO 0:02:44.542  ~  0:02:45.542


