데모 영상

영상과 이미지 데스모스같은 인터랙티브 수업의 차이



2디 그래프
미적분
삼각함수
음함수

카메라 움직이기


선형대수학
벡터 기본
트랜스폼
행렬

벡터필드
유체역학




테일러 급수
편미분
푸리에 변환
마님 물리엔진
스파이노그래프


it is empty text
Creating concated file
# TODO 5.69 secs중앙화 거래소는 사람들은 원자재나 주식 등 무언가를 편하게 거래하기 위해서 탄생했습니다
# TODO 0:00:24.080  ~  0:00:29.770
# TODO 1.0secs pause
# TODO 0:00:29.770  ~  0:00:30.770

# TODO 11.61 secs단순히 개인 대 개인으로 거래를 하려면 거래대상을 직접 찾기 힘들었고, 그 자리에서 일어나는 교환의 형태면 자리에 있는 동안만
#  상대방을 찾을 수 있고 예약 등의 형태로 거래하기가 어려웠습니다
# TODO 0:00:30.770  ~  0:00:42.380
# TODO 1.0secs pause
# TODO 0:00:42.380  ~  0:00:43.380

# TODO 13.76 secs그래서 모두가 통일된 규격으로 거래하고 일방적 계약파기의 위험을 없애고, 내가 자고 있어도 예약된 주문이 가능하게 하는 등 다
#  양한 편의를 위해 거래자 사이에 제3자인 거래소가 등장하고 거래소가 거래를 중개하기 시작했습니다
# TODO 0:00:43.380  ~  0:00:57.140
# TODO 1.0secs pause
# TODO 0:00:57.140  ~  0:00:58.140


'################################################################################################################1'

# TODO 11.9 secs그리고 비트코인을 입금받기 위해서는 에이에게서 비트코인을 받기위한 주소를 에이에게 알려주고 에이가 블록체인을 통해서 그 주소로 비트코인을 전송하면 확인한 뒤 거래소의 데이터베이스에 기록합니다
# TODO 0:00:41.540  ~  0:00:53.440
# TODO 1.0secs pause
# TODO 0:00:53.440  ~  0:00:54.440

# TODO 4.144 secs거래소 데이터 베이스에 에이의 비트코인 보유액이 업데이트 됐습니다
# TODO 0:00:54.440  ~  0:00:58.584
# TODO 1.0secs pause
# TODO 0:00:58.584  ~  0:00:59.584

'################################################################################################################1'

1
'중앙화 거래소가 어떻게 작동하는지 예를 보겠습니다. 우리가 관심있는 건 크립토니까 일반적인 크립토 거래소를 기준으로 설명하겠습니다#1'

'에이는 비트코인을 가지고 있습니다#1'
'비는 현금을 가지고 있습니다#1'
'에이는 비트코인을 현금으로 바꾸고 싶고, 비는 현금으로 비트코인을 구매하고 싶습니다#1'

'그리하여 에이와 비는 거래소로 자신의 자산인 비트코인과 현금을 각각 입금합니다#1'
'거래소는 현금을 받기위해 시중은행 계좌나 결제시스템을 통하고 입금을 확인한 뒤 자신의 데이터베이스에 기록합니다#1'
'거래소 데이터베이스에 비의 현금 보유액이 업데이트 됐습니다#1'
'그리고 비트코인을 입금받기 위해서는 에이에게서 비트코인을 받기위한 주소를 에이에게 알려주고 에이가 그 주소로 비트코인을 전송하면 확인한 뒤 거래소의 데이터베이스에 기록합니다#1'
'거래소 데이터 베이스에 에이의 비트코인 보유액이 업데이트 됐습니다#1'

'거래소 앱에서 자신의 재산을 확인한 에이와 비는 이제 거래할 준비가 됐습니다. 이제 둘은 페어로 갑니다#1'

'################################################################################################################1'
2

'더 진행하기 전에 몇 가지 사전학습을 하고 가겠습니다#1'
'차례대로 스테이블 코인, 주문의 종류, 가격, 가격의 종류, 슬리피지, 페어에 대해 알아보고 가겠습니다#1'
'################################################################################################################1'
3

'잠시 스테이블 코인에 대해서 알아보고 가겠습니다#1'
'일반적으로 거래소에서 은행계좌가 연동됐다면 원화나 달러같은 법정통화를 사용하고 그렇지 못 하면, 보통 스테이블 코인을 사용하게 됩니다#1'
'스테이블 코인은 일반적으로 실제 코인을 보증하는 법정통화를 바탕으로 발행하고 1대1로 교환될 수 있는 코인을 말합니다#1'
'이번에 큰 이슈가 된 테라나 코인을 담보로 스마트 컨트랙트로 발행되는 다이처럼 법정통화 없이도 스테이블 코인을 만들 수 있습니다#1'
'그러나 이번 영상의 범위를 벗어나기 때문에 나중에 따로 알아보겠습니다#1'
'가장 유명한 테더를 예로 들자면 1테더를 발행하기 위해서는 1달러를 담보로 맡겨야하고 테더사는 언제든 사람들에게 돈을 돌려줄 수 있게 지급준비율을 유지하며 받은 달러 일부를 활용해 투자수익을 얻습니다'
'다시 1테더를 가져가면 1테더를 소각시키고 1달러를 돌려받을 수 있습니다#1'
'이렇게 법정통화를 스테이블 코인으로 만들면 비트코인을 들고 있는 것처럼 변동성에도 노출이 안 되고 현금과 같은 가치를 지닌 자산을 어느나라 거래소든 지갑이든 국경을 자유롭게 이동할 수 있어 많이 사용합니다#1'

'################################################################################################################1'
4

'이제 에이와 비는 본격적으로 주문을 넣기 시작합니다#1'
'거래소에서 주문을 넣는 것에 대해서도 알고 가야할 게 있습니다#1'
'거래소에서 넣는 주문은 주문가격에 따라 크게 두 가지가 있습니다#1'
'리밋 주문과 마켓 주문이고 한국어로는 지정가 주문 시장가 주문이라고 부릅니다#1'
'이전에 들어본 스톱오더 트레일링오더 같은 것은 이 주문 종류에 추가 기능을 넣은 것입니다#1'
'지정가 주문은 말그대로 주문가격을 지정해놓는 주문이고 시장가 주문은 우리가 회를 먹을 때 싯가라고 부르듯이 그냥 그 자리에서 구할 수 있는대로 현재가격으로 즉시 체결하는 주문입니다#1'

'리밋 주문은 일반적으로 알고 있듯이 가격을 지정해서 그 가격에 거래하고 싶은 상대측이 나타나면 거래가 체결되는 주문입니다#1'
'마켓 주문은 원하는 주문량을 입력하면 현재 나와있는 매물 중 가장 유리한 가격대로 주문량이 모두 충족될 때까지 거래를 합니다#1'
'마켓 주문은 주문을 넣는 순간 돌이킬 수 없이 바로 체결되고 리밋 주문은 일반적으로 현재가격보다 더 유리한 가격에 걸어놓기에 기다려야 합니다#1'

'################################################################################################################1'
5

'가격이라는 것에 대해 정확하게 정의하고 가겠습니다#1'
'가격은경제,비즈니스면에서 물건,용역,자산의 금전적 수적가치를 따지는 것이다. 값,가액이라고도 한다#1'
'한 제품 및 서비스의 가격이란 소비자가 그 제품이나 서비스를 한 단위로 구매하기 위해 지불해야 하는 화폐의 양을 말한다#1'

'가격이란 것은 한 제품 및 서비스를 한 단위로 구매하기 위해 지불해야하는 화폐의 양입니다#1'
'비티씨 테더 페어에서 38000테더라고 적혀있다면 있다면 우리는 비티씨의 가격이 얼마라고 얘기합니까#1'
'38000달러라고 부릅니다. 그러나 이는 엄밀하게 보면 틀린 표현입니다#1'
'비티씨의 가격은 38000테더입니다. 테더와 달러는 다른 것입니다 #1'
'달러는 달러 그자체이고 테더는 이 달러를 담보로 발행했기에 테더 회사가 도망가면 테더는 디지털 쓰레기가 됩니다#1'
'달러를 옹호하는 건 아닙니다. 미국정부가 망하면 달러는 종이 쓰레기가 됩니다#1'
'테더는 실제로 거래해보면 보통 0.999에서 1.001 "달러"사이를 움직이며 거래되ㅃ니다.#1'
'테더는 달러가 아닙니다. 다른 스테이블 코인도 마찬가지이구요#1'
'마치 금본위제 시절에 달러가 금이랑 같다고 여기는 것과 같습니다#1'
'달러는 금이 아니고 금에 대한 보증서 개념이었고 달러가 금이 되기 위해서는 추가적으로 달러지폐를 금으로 교환하는 과정을 거쳐야 했습니다#1'
'지금까지의 얘기는 무의식적으로 달러와 테더가 같다고 여겨지는 생각을 없애기 위함이고 이것은 나중에 논스테이블 페어를 이해하는데 도움이 됩니다.#1'

'어쨌든 가격이란것은 단위 화폐에 따라 결정이 되는 것이고, 단위가 없는 무차원 수같은 것이 아닙니다#1'
'1비트코인은 5000만원 40000달러라고 부르지 500000000이나 40000이라고만 부르지 않습니다#1'

'가격은 어떻게 움직일까요#1'
'우리가 배우기로는 수요와 공급이 교차하는 지점에서 결정된다고 배웁니다#1'
'그러나 거래소에서의 가격은 그 말보다는 인내심이 더 부족한 쪽에 의해 결정된다고 하는게 이해하기 쉬울겁니다#1'
'누구나 더 높은 가격에 팔고 더 낮은 가격에 사고 싶기 때문에 호가창에는 지정가 주문들이 쌓이기 시작합니다#1'
'그렇게 지정가 주문들이 현재가 위 아래로 계속 쌓이기만 하면 가격은 움직이지 않습니다 #1'
'실제로 호가창에 100원과 101원이 맞닿아 있고 아무도 시장가 주문을 넣지 않으면 가격은 마지막 주문이 100원에서 매수였으면 100원 101원에서 매도였으면 101원에 정지해있습니다#1'
'그러다가 누군가 기다림을 참지 못하고 시장가로 구매를 하면 호가창에 쌓여있던 물량이 시장가로 소화되면서 가격은 움직입니다 #1'
'잘 생각해보면 모든 사람이 지정가 주문만 넣으면 아무 일도 일어나지 않고 모두 기다리기만 합니다#1'

'################################################################################################################1'
6

'가격의 종류에 대해 알아보겠습니다#1'

'아까 지정가와 시장가와는 다른 것이므로 착각하면 안 됩니다#1'
'지정가와 시장가는 실행 가격을 얼마로 할지에 따라 주문의 타입을 구별하는 것이므로 이름은 가격이지만 주문에 관한 설명입니다. 그래서 이제부터 다룰 가격과 맥락이 다릅니다#1'

'거래소의 창을 보다보면 가격이 100원 101원을 마구마구 왔다 갔다 하는 것을 봅니다#1'
'그리고 유심히 봤다면 어떤 거래소는 미세하게 다른 가격 2개가 표시되는 경우도 있습니다#1'
'거래소에 두개의 가격이 잇다면 보통 큰 글자나 더 잘보이게 한 가격을 거래가라고 부르고 작은 것을 시장가라고 부릅니다#1'
'단어예 약간 혼동이 있을 수 있는데 영어로는 last price와 mark price 라고 부릅니다#1'
'라스트 프라이스는 말그대로 가장 마지막에 주문이 체결된 가격이고, 마크 프라이스는 보통 규모가 큰 거래소에 거래량 가중치를 계산한 평균가격을 얘기합니다#1'
'한 거래소에서 갑작스럽게 큰 거래가 일어나서 그 거래소에서만 가격이 떨어지면 마크 프라이스는 그만 큼 떨어지지 않습니다#1'
'다른 거래소에서는 같은 하락이 이루어지지 않았고 그래서 평균치가 그렇게 내려가지 않았기 때문입니다#1'
'이 마크 프라이스는 나중에 보게될 선물의 청산을 위해 사용되는 경우가 많습니다#1'
'정리하자면 반짝반짝하면서 변하는 가격은 라스트 프라이스고 마크 프라이스는 당장은 알 필요가 없습니다#1'
'참고로 현재 가격이 100달러인데 150달러에 리밋 주문을 넣으면 일반적으로 거래소에서는 안전장치가 있어서 실수로 인지하고 그냥 마켓가로 넣어서 100달러에서 가장 가까운 지정가 매도 물량을 구매하게 됩니다#1'


'################################################################################################################1'

7
'지겹지만 실제 사례로 넘어가기 전 슬리피지에 대해서 알아보고 가겠습니다#1'
'100원에 지정가 매수 주문이 20개 #1'
'200원에 지정가 매수 주문이 10개 #1'
'300원에 지정가 매도 주문이 10개 #1'
'400원에에 지정가 매도 주문이 20개있는 상태입니다#1'
'갑자기 새로운 누군가 600원을 시장가로 매수할 경우 200원에 있던 10개 중 2개가 체결이됩니다#1'
'이 경우 매수를 하기 때문에 매수를 주문하는 사람은 원화를 들고 일반적으로 쿼트 에셋인 원화를 입력해 주문을 넣으나 베이스 에셋을 입력하면 거래소 앱이 자동으로 해당하는 만큼의 베이스  에셋을 구매할 때까지 원화를 소모하며 구매합니다#1'
'방금과 같은 경우에는 btc2개를 시장가 매수해도 같은 결과가 일어납니다#1'
'누군가 6개를 시장가로 매도할 경우 100원에 쌓여있던 10개 중 6개가 체결됩니다#1'
'마찬가지로 쿼트 에셋인 원화를 매도주문에 입력해도 거래소 앱에서 알아서 입력한 원화를 얻을 때까지 가지고 있는 베이스 에셋을 매도합니다#1'

'그러나 만약 가장 가까이 있는 호가창의 물량보다 큰 물량을 주문하면 어떻게 될까요#1'
'마켓주문은 반드시 발생한 즉시 목표를 달성하려고 하기 때문에 가장 가까운 호가창의 물량을 다 삼키도고 목표 달성을 못 하면 다음 호가창으로 넘어가서 체결되기 시작합니다#1'

'예를 들어 비티씨를 25개 시장가로 매수하면 당장 300원에 있는 비티씨들 10개를 매수하고 그 다음은 400원에 걸린 15개를 매수합니다#1'
'그래서 총 소비한 비용은 300원 곱하기 25개인 7500이 아니라 300곱하기 10 더하기 400곱하기 15 총 9000원이 됩니다#1'
'여기서 슬리피지란 내가 주문을 넣을 때 기대하는 가격과 실제 평균 체결가의 차입니다#1'
'주문을 넣을 때는 300원을 보고 300원에 25개가 체결되는 것을 기대했지만 실제로는 25개를 구입하느데 총 9000원을 소비했기 때문에 9000나누기 25인 360원이 평균가격이고 60원의 슬리피지가 발생했다고 합니다#1'
'이 가격차인 슬리피지에 따른 비용으로 9000원 빼기 7500원인 1500원이 발생한 것입니다#1'

'슬리피지는 단순히 호가창의 물량으로만 설명되는 것이 아니고 주문을 넣은 뒤 결과적으로 내가 받게되는 영향입니다#1'
'즉 내가 주문을 넣고 그 사이에 시장 상황이 변동해서 영향을 받을 수도 있습니다#1'
'각 컴퓨터의 네트워크 상태나 서버상태 등도 슬리피지에 영향을 줄 수 있습니다#1'

'################################################################################################################1'
'페어는 거래쌍이라고 불리며 일반적으로 물리적인 진짜 시장이 아니라 거래가 일어나는 디지털 공간을 의미합니다#1'
'두 자산이 짝을 이루고 서로 교환이 일어나기 때문에 페어라고 부릅니다#1'
'은행과 연계된 중앙화거래소는 보통 법정화폐 거래쌍을 제공합니다#1'
'지금은 스테이블코인을 사용하는 거래쌍을 예로 들겠습니다#1'
'페어를 표시할 때는 보통 슬래시나 대시를 사용하거나 그냥 티커를 붙여서 표시하기도 합니다#1'
'그리고 일반적으로 왼쪽의 자산을 베이스 에셋 오른쪽을 쿼트 에셋이라고 부릅니다#1'
'비티씨 테더 거래쌍의 가격이 현재 100이라면 현재 비티씨는 100테더라는 것입니다#1'
'심볼처럼 말그대로 1베이스 에셋을 얻으려면 얼마나 많은 쿼트 에셋을 줘야하는지를 표시하는 것입니다#1'
'여기서 베이스 에셋이 비티씨라고 테더를 가지고 이더를 사기만 할 수 있는게 아니라 당연히 비티씨를 가지고 테더를 살 수도 있습니다#1'
'우린 이걸 각각 비티씨를 매수한다, 매도한다라고 부릅니다. 비티씨 매수는 테더 매도와 같고, 테더 매수는 비티씨 매도와 같습니다#1'
'거래 자체가 서로 다른 걸 교환하는 것이기에 내가 비트코인을 들고있는 쪽이 될지 테더를 들고있는 쪽이 될지는 마음대로 정할 수 있습니다 #1'
'일반적으로 거래쌍의 표기에 있어서는 가격이란 것이 원래 자산의 가치 변동을 표현하기 위한 것이므로 상대적으로 변동성이 큰 자산이 베이스 에셋이 되고 '
'그에 비해 더 안정적이고 유명한 자산이 가치의 척도가 되기에 용이해 쿼트 에셋으로는 상대적으로 변동성이 작은 스테이블 코인, 법정통화, 비티씨, 이더리움 등이 많이 사용됩니다#1'
'일반적인 주식 어플에서는 베이스 에셋과 쿼트 에셋을 생각해본 적이 없을 겁니다#1'
'어차피 전부 쿼트에셋으로 원화만 사용하기 때문에 거래쌍이라는 개념보다는 주식쇼핑같은 느낌입니다#1'
'하지만 외환시장, 즉 FOREX를 겪어보신 분이면 달러 엔, 유로 달러등의 거래쌍을 보셨을 겁니다#1'
'크립토 마켓도 특정 코인을 사기위해서 비트코인이나 이더리움을 지불하는 경우도 많고, 스테이블 코인만 해도 종류가 여러가지여서 거래쌍 개념이 더 절실히 다가옵니다#1'
'주식에서는 1 현대차가 3 삼성전자 이런 식으로 표현하지 않지만 크립토마켓에서는 1이더리움은 0.1비티씨, 1폴카닷은 0.01이더리움과 같은 표현이 많이 나옵니다#1'

'################################################################################################################1'

'이제 실제 에이비가 주문을 넣는것으로 더 자세히 알아보겠습니다#1'
'에이는 비트코인을 삐싸계 팔고싶어하고, 비는 비트코인을 싸게 사고 싶어합니다#1'
'현재 거래쌍에 보이는 가격은 1억원입니다#1'
'그래서 에이는 비트코인을 400에 판매하는 매도 지정가주문을 넣고 삐는 100만원에 매수 주문을 넣습니다.#1'
'그러나 가격이 지정가까지 올 생각을 안 하자 둘은 현재가에 더 가깝게#1'
'주문을 수정해 에이는 300에 매도, 비는 200원에 매수 주문을 넣습니다.#1'
'여전히 가격 안 움직이고 비트코인을 너무 사고 싶었던 에이는 시장가 주문을 하면서 비에게 비트코인을 구매합니다.#1'
'기분이 좋아진 비는 어디서 들었는지 개인지갑에 비트코인을 보관해야된다는 애기가 기억나 비트코인 지갑 어플을 받아 개인지갑을 만들고 거래소에 그 주소로 출금을 요청합니다#1'
'거래소는 비의 요청을 확인하고 거래소의 지갑에서 블록체인상으로 에이의 요청 주소로 비트코인을 전송하고 거래소 데이터베이스에서 비의 비트코인 보유액을 차감합니다.#1'
'에이는 비트코인으로 테슬라를 사려 했지만 구매가 막혀 비트코인을 팔아 마련한 원화로 테슬라를 사기위해 출금을 하려합니다#1'
'마찬가지로 거래소에 출금을 요청하고 거래소는 에이가 등록한 은행 계좌로 원화를 송금하고 데이터베이스에서 원화 보유액을 차감합니다#1'





# TODO 7.72 secs여기서 베이스 에셋이 비티씨라고 테더를 가지고 이더를 사기만 할 수 있는게 아니라 당연히 비티씨를 가지고 테더를 살 수도 있습니다
# TODO 0:00:26.976  ~  0:00:34.696
# TODO 1.0secs pause
# TODO 0:00:34.696  ~  0:00:35.696



# TODO 4.035 secs우린 이걸 각각 비티씨를 매수한다, 매도한다라고 부릅니다
# TODO 0:00:35.696  ~  0:00:39.731
# TODO 1.0secs pause
# TODO 0:00:39.731  ~  0:00:40.731



# TODO 8.106 secs거래 자체가 서로 다른 걸 교환하는 것이기에 내가 비트코인을 들고있는 쪽이 될지 테더를 들고있는 쪽이 될지는 마음대로 정할 수 있습니다
# TODO 0:00:40.731  ~  0:00:48.837
# TODO 1.0secs pause
# TODO 0:00:48.837  ~  0:00:49.837



# TODO 20.912 secs일반적으로 거래쌍의 표기에 있어서는 가격이란 것이 원래 자산의 가치 변동을 표현하기 위한 것이므로 상대적으로 변동성이 큰 자산이 베이스 에셋이 되고
#  그에 비해 더 안정적이고 유명한 자산이 가치의 척도가 되기에 용이해 쿼트 에셋으로는 상대적으로 변동성이 작은 스테이블 코인, 법정통화, 비티씨, 이더리움 등이 많이 사용됩니다
# TODO 0:00:49.837  ~  0:01:10.749
# TODO 1.0secs pause
# TODO 0:01:10.749  ~  0:01:11.749










'수학적 모델과 도구들은 복제자 동학과 개체군 동학을 연구하는데 중요하게 쓰입니다#1'

'어찌보면 생물의 진화나 번식이 수학과는 관련이 없을 것 같지만#1'

'감정을 가진 생명체 인간의 행위들을 게임이론이라는 수학적 접근을 통해 분석하려는 것처럼 복제자,개체군 같은 생명체의 변화도 수학적 접근의 렌즈를 통해보면 많을 것을 알 수 있습니다#1'

'현실을 모델링 하여 시뮬레이션을 하고 많은 세대를 거치며 행동의 진화가 어떤 식으로 일어나는지 연구를 합니다#1'

'이런 모델들은 굉장히 단순하고 그래서 현실을 정확하게 반영하는 것은 터무니없어 보입니다#1'

'고르디언 매듭을 멋대로 잘라버린 알렉산드로스 대왕처럼 이렇게 해도 될까요?#1'

'이런 걱정에도 불구하고 수학적 모델링은 굉장히 유용합니다#1'

'사실 진화생물학은 이런 수학적 실험과 모델에 의해 상당한 영향을 받았습니다#1'

'그래서 하기 싫어도 복제자 동학, 개체군 동학 등의 진화생물학 논문등을 읽으려면 수학적 기반이 필요합니다#1'


'이제 본격적으로 복제자 동학과 개체군 동학에 대해 알아봅시다#1'
'왜 단순한 수학적 모델을 사용하는가?#1'


'앞으로 다루게 될 모델은 현실보다 매우 간소화된 모델입니다#1'

'인구는 무한하거나 무한에 가깝게 가정하고 각 유전과 번식은 현실과 다르게 정해진 형태로 일어납니다#1'

'부모와 자식 세대는 시간상으로 겹치지 않아 세대들은 이산적입니다#1'

'즉 세대마다 구별이 확실히 되고  통계적 효과는 사실상 없는 것에 가깝고 유전자 상호작용등은 없는 그런 모델입니다#1'

'도대체 현실의 이런 부분들을 다 빼고 만든 모델이 무슨 의미가 있을까요#1'

'수학적 모델은 구체성과 디테일을 포기하고 추적가능성과 명확성을 잡았습니다#1'

'추적가능성은 시스템이 어떻게 돌아가는지 변화를 추적할 수 있는지입니다#1'


'우린 물건에 문제가 생겼을 때 전 생산과정을 따라가며 문제를 찾아냅니다#1'

'수학적 모델에서도 마찬가지입니다#1'

'수학적으로 명시적으로 정의됐기 때문에 우리가 문제를 풀다 답이 틀리면 풀이과정을 따라가며 다시 풀 듯이 변화의 순간들을 모두 이해하고 포착하고 되돌아볼 수 있습니다#1'

'명확성은 다음과 같이 생각할 수 있습니다#1'

'우리는 여러가지 지도를 봅니다#1'

'지형이 포함된 위성사진으로 만들어진 지도도 있고, 지하철 노선만 나와있는 지도도 있고, 맛집지도도 있습니다#1'










'이 지도들은 용도에 맞게 정보를 제한함으로 우리에게 더 명확하고 한눈에 들어오는 방식으로 정보를 전달합니다#1'


'한 지도에 위성사진, 지하철 노선도, 맛집 등이 모두 뒤엉켜 있다면 현실에는 가깝지만 결코 한 눈에 들어오는 지도는 아닐 것입니다#1'

'그래서 게임이론적 접근은 우리가 집중하고 싶은 몇가지 특성에만 집중하고 나머지를 잠시 접어둔 것입니다#1'

'사회과학이나 경제 실험에서도 일부 변수들을 고의적으로 통제하거나 제외하는 것이 받아들여지고 물리교과서에는 물리문제도 마찰은 무시한다는 것을 자주 봤을 것이고 수학교과서에는 p,q는 자연수, r은 실수 라는 등의 조건을 답니다#1'

'모두 본질에 더 가까이 가기 위해 잠시 빼놓는 것일 뿐입니다#1'




'이쯤되면 아마 그냥 전부 시뮬레이션하면 되는 거 아니야라고 생각하실겁니다#1'


'컴퓨터 성능이 빠른 속도로 발전하면서 과거보다 분명히 시뮬레이션 하기 수월한 상황입니다#1'


'수많은 수식과 방정식을 볼 때,  논리적인 추론을 통해 문제를 푸는 방식을 해석젂 방법을 버리고 전부 시뮬레이션을 하고싶은 유혹은 어찌보면 당연할 것입니다#1'

'그러나 시뮬레이션에는 다음과 같은 한계점이 있습니다#1'


'방정식은 우리에게 왜 진화가 이런 방식으로 작동하는지를 말해줍니다#1'
'방정식에 있는 항과 기호들은 우리에게 시스템에 대한 직관을 줄 수 있습니다#1'

'해석적 방법은 우리에게 증명을 선물합니다#1'
'하지만 시뮬레이션은 단지 예시를 생산할 뿐입니다#1'
'시뮬레이션은 파라미터에 취약합니다#1'
'시뮬레이션을 돌리는데는 여러가지 파라미터가 있을 것입니다#1'
'초기 인구의 크기, 질병에 걸렸을 때 사망률, 개체간 상호작용의 확률 등 여러가지 파라미터를 입력하게 됩니다#1'
'그리고 이런 파라미터가 약간만 바뀌어도 예측하지 못 한 결과가 나오는 경우가 많습니다#1'
'해석적 방법에서는 파라미터의 변화에도 간단히 계산할 수 있지만#1'
'시뮬레이션에서는 초기 인구사이즈를 10, 20, 30으로 하고 사망률을 0.1, 0.2, 0.3 , 상호작용 확률을 0.5, 0.7, 1로 놓게 되면 벌써 시뮬레이션을 $3^3$ 번 돌려야합니다#1'
'만약 더 넓은 범위와 더 좁은 간격으로 모든 케이스들을 다루려면 현대의 컴퓨팅 파워로도 쉽지 않습니다#1'
'그리고 이렇게 생성한 막대한 데이터를 다루고 의미있는 인사이트를 추출하는 것도 쉽지 않은 일입니다#1'
'그러므로 해석적 방법이 적용가능하다면 시도하는 게 좋은 선택일 것입니다#1'

'시뮬레이션은 재현이 쉽지 않을 수 있습니다#1'
'어떠한 이론이 인정받기 위해서는 재현이 가능해야할 것입니다#1'
'내가 실험하면 사과가 아래로 떨어지고 남이 실험하면 오른쪽으로 날아간다면 인정받지 못 할 것입니다#1'
'이것을 재현가능성 reproducibility라고 부릅니다#1'
'시뮬레이션에서는 랜덤이나 확률을 사용할 때 매번 같은 결과가 나오지 않을 수 있습니다#1'

'해석적 방법이 항상 적용가능한 것도 아니고#1'
'시뮬레이션이 모든 것을 해결할 수 있는 것도 아닙니다#1'
'해석적 방법과 시뮬레이션은 상호보완적으로 사용되어야 할 것입니다#1'

'이번에는 개체군 유전학자들이 viability selection 이라고 부르는 개념을 알아보겠습니다#1'

'한국어로는 참고할 만한 기존 번역이 없어서 임의로 생존력에 따른 선택이라고 하겠습니다#1'

'이제부터 유기체의 일생을 통해 개체군 내 장기적 유전자 변화가 어떻게 일어나는지 보겠씁니다#1'

'앞으로 다루게 될 모델들의 몇가지 가정을 살펴보겠습니다#1'

'개체군 population 이란 얼마나 많은 개체들이 있고 어떻게 사회적 조직이 구성되는지를 나타내는 말입니다#1'
'유전가능한 변이들의 집합 a set of heritable variants 란 유전적 진화에서는 서로다른 유전형들을 얘기하고 문화적 진화에서는 뇌에 저장되고 세대를 거쳐 전달되는 지식을 말합니다#1'
'일생 life cycle 이란 개체가 살아있는 동안 겪고 유전가능한 변이들의 집합의 생존과 번식에 영향을 끼치는 이벤트들을 의미합니다#1'


'제일 먼저 해야할 것은 한 세대 동안 유기체의 일생에서 개체군 내 유전형들의 분포를 바꿀 수 있는 이벤트들을 수학적으로 표현하는 것입니다#1'
'한 세대를 표현할 줄 알면 여러세대도 표현할 수 있고, 장기간에 걸친 변화를 살펴볼 수 있습니다#1'
'이것은 간단한 생존도에 의한 선택 모델입니다#1'
'어떠한 시점 t 에서 수정란은 시간이 지나면서 성장하고 본인의 특성이 주위환경과 맞냐 안 맞냐에 따라 살아남기도 하고 죽기도 합니다#1'
'만약 살아남는다면 성체가 됩니다#1'
'성체는 짝짓기를 하고 t+1 시점을 살아갈 새로운 수정란을 만들고 죽습니다#1'

't+1에서 수정란은 같은 과정을 반복합니다#1'


'개체군 안에 n 명의 개체가 있다고 가정합시다#1'

'n은 표본오차를 무시할 수 있을 정도로 크다고 하겠습니다#1'

'이 개체들은 반수체로서 성별이나 유전자 재조합이 없이 번식합니다#1'

'엄밀하지는 않지만 그냥 세균이나 무성생식처럼 짝짓기 없이 번식한다고 생각하면 편합니다#1'

'그리고 A, B 두 가지 유전형이 있습니다#1'

'세대는 이산적입니다#1'

'이것은 각 개체들이 성장하는 과정이 같은 속도로 함께 일어나고 함께 번식하고 함께 죽는다는 것입니다#1'

'n개의 수정란이 어떤 시점 t에 존재합니다#1'

'일부 수정란은 자연선택에 맞써 살아남았고 성인이 됐씁니다#1'

'A타입의 개체들이 B타입의 개체보다 더 생존에 적합했습니다#1'

'살아남은 성체들은 이제 번식을 하고 다음 세대인 t+1 세대의 수정란을 만듭니다#1'

'이제 세대를 거친 변화 속에서 개채군 내 특정 유전자의 비율을 알아볼 것입니다#1'

'쉽게 얘기하면 전체 개체수 중에 A가 몇 퍼센트냐라는 것이고 당연히 0에서 1의 값을 가집니다#1'

'A가 하나도 없고 B만 있다면 A의 비율은 0일 것이고 B가 없고 A만 있다면 A의 비율은 1일 것입니다#1'

'이런 비율을 동적 시스템을 연구하는 수학자들은 상태변수라고 부릅니다#1'

'상태변수는 시스템의 상태를 나타내는 수라고 생각하시면 됩니다#1'

'이 상태변수를 통해 미래 세대의 상태를 예측합니다#1'



'개체군 유전 모델에서는 상태변수의 개수는 대립 유전자의 개수보다 한 개 적습니다#1'

'개체군에서  개체들이 A혹은 B 두가지 형질만 가진다고 하면#1'

'A의 비율이 p 일 때 B의 비율은 1-p가 됩니다#1'

'만약 형질이 3가지가 있다면#1'

'A의 비율이 $p_1$ , B의 비율  $p_2$ , C의 비율은 1- $p_1$- $p_2$가 됩니다#1'

'수많은 세대에 걸친 변화를 파악하기 위해 매 세대마다 우리는 인구조사를 할 것입니다#1'

'A, B 두 가지 형질만 존재하는 모델이라고 할 때, 어떤 시점 t에서 A의 비율인 p의 값은 다음과 같습니다#1'
'n은 현재 전체 개체의 수입니다#1'

'이 식을 변형하면 A수정란의 개수는 np입니다#1'

'자연스럽게 B수정란의 개수는 n(1-p)이 됩니다#1'

'매 세대를 거칠 때마다 어떤 형질이 더 잘 생존하냐에 따라 p의 값은 계속 변할 것입니다#1'

'변수 p는 이 모델에서 유일한 상태변수이고 우리는 p라는 상태변수 하나를 통해 A,B 두가지 형질의 시간에 따른 변화를 알아낼 수 있습니다#1'

'관습적으로 개체군 동학에서 p'은 다음세대의 p값을 의미하고  p prime이라고 부릅니다#1'

'현재 우리에게 있는 정보는 수정란들 중에 A형질을 가진 개체의 수 , B형질을 가진 개체의 수입니다#1'

'이제 수정란은 성장하고 일부는 살아남을 것입니다#1'

'V(A), V(B)는 각각 A, B형질을 가진 개체가 성체가 될 때까지 살아남을 확률입니다#1'

'에를 들어 V(A)가 0.5하면 A형질을 가진 수정란의 절반이 성체가 됩니다#1'


'번식을 할 수 있는 성체들 중 A의 비율은 다음과 같습니다#1'

'이 모델에서 성체들은 형질에 상관없이 모두 혼자서 무성생식을 하며 z개의 수정란을 만듭니다#1'

'이 가정하에 p'' 는 t+1시점에서 A형질 수정란의 비율이라고 하겠습니다#1'







'이런 형태를 수학에서는 재귀 recusion이라고 부릅니다#1'

'재귀는 자신을 정의할 때 자기 자신을 재참조하는 방법이라는 뜻입니다#1'

'이제 앞으로 매 세대마다 p가 어떻게 변화하는  알 수 있습니다#1'

'1세대에서의 p를 $p_1$이라고 하겠습니다#1'

'$p_2$는 다음과 같습니다#1'

'그리고 $p_3$는 똑같이 $p_1$자리에 $p_2$를 넣어주면 구할 수 있습니다#1'

'그리고 더 멋지게 표현하자면 미분방정식을 사용할 수 있습니다#1'

'미분방정식은 다음 식에서 -p에 pV(A)+(1-p)V(B)를 곱해줘 통분을 하고 계산하면 다음과 같이 나옵니다#1'
'일반적으로 분모부분 $pV(A)+(1-p)V(B)$는 $\bar{w}$로 표현합니다#1'

'이 부분은 개체군 내 평균 적합도를 의미합니다#1'

'이제 깔끔하게 표현하면 다음과 같이 됩니다#1'


'이 미분방정식은 생존도에 따른 선택의 복제자 동학이라고 불리웁니다#1'

'앞으로 매우 많이 보게 될 것이기 때문에 정확하게 이해하고 넘어가야합니다#1'

'첫번째 p(1-p)는 개체군 내 형질의 분산입니다#1'

'이항분포를 따르기 때문에 p(1-p)입니다#1'

'둘 중 한 형질이 만연할 때 p(1-p)는 작아집니다#1'

'분산은 두 형질이 반반(p=0.5) 있을 때 가장 커집니다#1'

'이것은 자연선택이 분산이 최대일 때 최대로 일어난다는 것입니다#1'

'자연선택은 도태의 과정이기도 합니다#1'

'도태시킬 개체들이 가장 많을 때 변화는 빠르게 일어납니다#1'

'끝에는 분산이 0이 되면 즉, p(1-p)=0이면 델타p가 0이 되면서#1'

'세대를 거듭해도 아무것도 바뀌지 않는 상태가 됩니다#1'

'p(1-p)=0 이라는 것은 p가 0 또는 1이라는 것인데 한 개체군이 한가지 형질로만 구성된 상태인 것입니다#1'

'두번째 부분은 $\frac{V(A)-V(B)}{\bar{w}}$는 단순히 A형질이 B형에 비해 얼마나 증감하는지 나타낸 비입니다#1'

'A가 B보다 더 잘 적응하는 형질이라면 $\frac{V(A)-V(B)}{\bar{w}}$는 0보다 클 것이고 세대를 거치면서 형질에 분산이 남아있는한 p(1-p)>0 p는 증가할 것입니다#1'

'반대로  $\frac{V(A)-V(B)}{\bar{w}}$가 0보다 작다면 세대마다 점점 p는 감소할 것입니다#1'



'추가적으로 각 형질이 단순히 생존도만 다른게 아니라 생산하는 수정란 수도 다른 경우를 보겠습니다#1'


'아까 봤던 다음 세대 수정란의 수 공식에서 수정란 수를 곱해주면 됩니다#1'

'그리고 수정란의 영향도 전부 적합도로 뭉뚱그려서 다음과 같이 표현할 수도 있다#1'






class working2(ThreeDScene):

    def construct(self):
        speak(self, title='Scene2', txt=

        '수학적 모델과 도구들은 복제자 동학과 개체군 동학을 연구하는데 중요하게 쓰입니다#1'

        '어찌보면 생물의 진화나 번식이 수학과는 관련이 없을 것 같지만#1'

        '감정을 가진 생명체 인간의 행위들을 게임이론이라는 수학적 접근을 통해 분석하려는 것처럼 복제자,개체군 같은 생명체의 변화도 수학적 접근의 렌즈를 통해보면 많을 것을 알 수 있습니다#1'

        '현실을 모델링 하여 시뮬레이션을 하고 많은 세대를 거치며 행동의 진화가 어떤 식으로 일어나는지 연구를 합니다#1'

        '이런 모델들은 굉장히 단순하고 그래서 현실을 정확하게 반영하는 것은 터무니없어 보입니다#1'

        '고르디언 매듭을 멋대로 잘라버린 알렉산드로스 대왕처럼 이렇게 해도 될까요#1'

        '이런 걱정에도 불구하고 수학적 모델링은 굉장히 유용합니다#1'

        '사실 진화생물학은 이런 수학적 실험과 모델에 의해 상당한 영향을 받았습니다#1'

        '그래서 하기 싫어도 복제자 동학, 개체군 동학 등의 진화생물학 논문등을 읽으려면 수학적 기반이 필요합니다#1'


        '이제 본격적으로 복제자 동학과 개체군 동학에 대해 알아봅시다#1'
        '왜 단순한 수학적 모델을 사용하는가#1'


        '앞으로 다루게 될 모델은 현실보다 매우 간소화된 모델입니다#1'

        '인구는 무한하거나 무한에 가깝게 가정하고 각 유전과 번식은 현실과 다르게 정해진 형태로 일어납니다#1'

        '부모와 자식 세대는 시간상으로 겹치지 않아 세대들은 이산적입니다#1'

        '즉 세대마다 구별이 확실히 되고  통계적 효과는 사실상 없는 것에 가깝고 유전자 상호작용등은 없는 그런 모델입니다#1'

        '도대체 현실의 이런 부분들을 다 빼고 만든 모델이 무슨 의미가 있을까요#1'

        '수학적 모델은 구체성과 디테일을 포기하고 추적가능성과 명확성을 잡았습니다#1'

        '추적가능성은 시스템이 어떻게 돌아가는지 변화를 추적할 수 있는지입니다#1'


        '우린 물건에 문제가 생겼을 때 전 생산과정을 따라가며 문제를 찾아냅니다#1'

        '수학적 모델에서도 마찬가지입니다#1'

        '수학적으로 명시적으로 정의됐기 때문에 우리가 문제를 풀다 답이 틀리면 풀이과정을 따라가며 다시 풀 듯이 변화의 순간들을 모두 이해하고 포착하고 되돌아볼 수 있습니다#1'

        '명확성은 다음과 같이 생각할 수 있습니다#1'

        '우리는 여러가지 지도를 봅니다#1'

        '지형이 포함된 위성사진으로 만들어진 지도도 있고, 지하철 노선만 나와있는 지도도 있고, 맛집지도도 있습니다#1'










        '이 지도들은 용도에 맞게 정보를 제한함으로 우리에게 더 명확하고 한눈에 들어오는 방식으로 정보를 전달합니다#1'


        '한 지도에 위성사진, 지하철 노선도, 맛집 등이 모두 뒤엉켜 있다면 현실에는 가깝지만 결코 한 눈에 들어오는 지도는 아닐 것입니다#1'

        '그래서 게임이론적 접근은 우리가 집중하고 싶은 몇가지 특성에만 집중하고 나머지를 잠시 접어둔 것입니다#1'

        '사회과학이나 경제 실험에서도 일부 변수들을 고의적으로 통제하거나 제외하는 것이 받아들여지고 물리교과서에는 물리문제도 마찰은 무시한다는 것을 자주 봤을 것이고 수학교과서에는 p,q는 자연수, r은 실수 라는 등의 조건을 답니다#1'

        '모두 본질에 더 가까이 가기 위해 잠시 빼놓는 것일 뿐입니다#1'




        '이쯤되면 아마 그냥 전부 시뮬레이션하면 되는 거 아니야라고 생각하실겁니다#1'


        '컴퓨터 성능이 빠른 속도로 발전하면서 과거보다 분명히 시뮬레이션 하기 수월한 상황입니다#1'


        '수많은 수식과 방정식을 볼 때,  논리적인 추론을 통해 문제를 푸는 방식을 해석젂 방법을 버리고 전부 시뮬레이션을 하고싶은 유혹은 어찌보면 당연할 것입니다#1'

        '그러나 시뮬레이션에는 다음과 같은 한계점이 있습니다#1'


        '방정식은 우리에게 왜 진화가 이런 방식으로 작동하는지를 말해줍니다#1'
        '방정식에 있는 항과 기호들은 우리에게 시스템에 대한 직관을 줄 수 있습니다#1'

        '해석적 방법은 우리에게 증명을 선물합니다#1'
        '하지만 시뮬레이션은 단지 예시를 생산할 뿐입니다#1'
        '시뮬레이션은 파라미터에 취약합니다#1'
        '시뮬레이션을 돌리는데는 여러가지 파라미터가 있을 것입니다#1'
        '초기 인구의 크기, 질병에 걸렸을 때 사망률, 개체간 상호작용의 확률 등 여러가지 파라미터를 입력하게 됩니다#1'
        '그리고 이런 파라미터가 약간만 바뀌어도 예측하지 못 한 결과가 나오는 경우가 많습니다#1'
        '해석적 방법에서는 파라미터의 변화에도 간단히 계산할 수 있지만#1'
        '시뮬레이션에서는 초기 인구사이즈를 10, 20, 30으로 하고 사망률을 0.1, 0.2, 0.3 , 상호작용 확률을 0.5, 0.7, 1로 놓게 되면 벌써 시뮬레이션을 $3^3$ 번 돌려야합니다#1'
        '만약 더 넓은 범위와 더 좁은 간격으로 모든 케이스들을 다루려면 현대의 컴퓨팅 파워로도 쉽지 않습니다#1'
        '그리고 이렇게 생성한 막대한 데이터를 다루고 의미있는 인사이트를 추출하는 것도 쉽지 않은 일입니다#1'
        '그러므로 해석적 방법이 적용가능하다면 시도하는 게 좋은 선택일 것입니다#1'

        '시뮬레이션은 재현이 쉽지 않을 수 있습니다#1'
        '어떠한 이론이 인정받기 위해서는 재현이 가능해야할 것입니다#1'
        '내가 실험하면 사과가 아래로 떨어지고 남이 실험하면 오른쪽으로 날아간다면 인정받지 못 할 것입니다#1'
        '이것을 재현가능성 reproducibility라고 부릅니다#1'
        '시뮬레이션에서는 랜덤이나 확률을 사용할 때 매번 같은 결과가 나오지 않을 수 있습니다#1'

        '해석적 방법이 항상 적용가능한 것도 아니고#1'
        '시뮬레이션이 모든 것을 해결할 수 있는 것도 아닙니다#1'
        '해석적 방법과 시뮬레이션은 상호보완적으로 사용되어야 할 것입니다#1'

        '이번에는 개체군 유전학자들이 viability selection 이라고 부르는 개념을 알아보겠습니다#1'

        '한국어로는 참고할 만한 기존 번역이 없어서 임의로 생존력에 따른 선택이라고 하겠습니다#1'

        '이제부터 유기체의 일생을 통해 개체군 내 장기적 유전자 변화가 어떻게 일어나는지 보겠씁니다#1'

        '앞으로 다루게 될 모델들의 몇가지 가정을 살펴보겠습니다#1'

        '개체군 population 이란 얼마나 많은 개체들이 있고 어떻게 사회적 조직이 구성되는지를 나타내는 말입니다#1'
        '유전가능한 변이들의 집합 a set of heritable variants 란 유전적 진화에서는 서로다른 유전형들을 얘기하고 문화적 진화에서는 뇌에 저장되고 세대를 거쳐 전달되는 지식을 말합니다#1'
        '일생 life cycle 이란 개체가 살아있는 동안 겪고 유전가능한 변이들의 집합의 생존과 번식에 영향을 끼치는 이벤트들을 의미합니다#1'


        '제일 먼저 해야할 것은 한 세대 동안 유기체의 일생에서 개체군 내 유전형들의 분포를 바꿀 수 있는 이벤트들을 수학적으로 표현하는 것입니다#1'
        '한 세대를 표현할 줄 알면 여러세대도 표현할 수 있고, 장기간에 걸친 변화를 살펴볼 수 있습니다#1'
        '이것은 간단한 생존도에 의한 선택 모델입니다#1'
        '어떠한 시점 t 에서 수정란은 시간이 지나면서 성장하고 본인의 특성이 주위환경과 맞냐 안 맞냐에 따라 살아남기도 하고 죽기도 합니다#1'
        '만약 살아남는다면 성체가 됩니다#1'
        '성체는 짝짓기를 하고 t+1 시점을 살아갈 새로운 수정란을 만들고 죽습니다#1'

        't+1에서 수정란은 같은 과정을 반복합니다#1'


        '개체군 안에 n 명의 개체가 있다고 가정합시다#1'

        'n은 표본오차를 무시할 수 있을 정도로 크다고 하겠습니다#1'

        '이 개체들은 반수체로서 성별이나 유전자 재조합이 없이 번식합니다#1'

        '엄밀하지는 않지만 그냥 세균이나 무성생식처럼 짝짓기 없이 번식한다고 생각하면 편합니다#1'

        '그리고 A, B 두 가지 유전형이 있습니다#1'

        '세대는 이산적입니다#1'

        '이것은 각 개체들이 성장하는 과정이 같은 속도로 함께 일어나고 함께 번식하고 함께 죽는다는 것입니다#1'

        'n개의 수정란이 어떤 시점 t에 존재합니다#1'

        '일부 수정란은 자연선택에 맞써 살아남았고 성인이 됐씁니다#1'

        'A타입의 개체들이 B타입의 개체보다 더 생존에 적합했습니다#1'

        '살아남은 성체들은 이제 번식을 하고 다음 세대인 t+1 세대의 수정란을 만듭니다#1'

        '이제 세대를 거친 변화 속에서 개채군 내 특정 유전자의 비율을 알아볼 것입니다#1'

        '쉽게 얘기하면 전체 개체수 중에 A가 몇 퍼센트냐라는 것이고 당연히 0에서 1의 값을 가집니다#1'

        'A가 하나도 없고 B만 있다면 A의 비율은 0일 것이고 B가 없고 A만 있다면 A의 비율은 1일 것입니다#1'

        '이런 비율을 동적 시스템을 연구하는 수학자들은 상태변수라고 부릅니다#1'

        '상태변수는 시스템의 상태를 나타내는 수라고 생각하시면 됩니다#1'

        '이 상태변수를 통해 미래 세대의 상태를 예측합니다#1'



        '개체군 유전 모델에서는 상태변수의 개수는 대립 유전자의 개수보다 한 개 적습니다#1'

        '개체군에서  개체들이 A혹은 B 두가지 형질만 가진다고 하면#1'

        'A의 비율이 p 일 때 B의 비율은 1-p가 됩니다#1'

        '만약 형질이 3가지가 있다면#1'

        'A의 비율이 매우복잡한 수식이다 , B의 비율매우복잡한 수식이다, C의 비율은 1- 매우복잡한 수식이다가 됩니다#1'

        '수많은 세대에 걸친 변화를 파악하기 위해 매 세대마다 우리는 인구조사를 할 것입니다#1'

        'A, B 두 가지 형질만 존재하는 모델이라고 할 때, 어떤 시점 t에서 A의 비율인 p의 값은 다음과 같습니다#1'
        'n은 현재 전체 개체의 수입니다#1'

        '이 식을 변형하면 A수정란의 개수는 np입니다#1'

        '자연스럽게 B수정란의 개수는 n(1-p)이 됩니다#1'

        '매 세대를 거칠 때마다 어떤 형질이 더 잘 생존하냐에 따라 p의 값은 계속 변할 것입니다#1'

        '변수 p는 이 모델에서 유일한 상태변수이고 우리는 p라는 상태변수 하나를 통해 A,B 두가지 형질의 시간에 따른 변화를 알아낼 수 있습니다#1'

        '관습적으로 개체군 동학에서 p은다음세대의p값을의미하고p prime이라고부릅니다#1'

        '현재 우리에게 있는 정보는 수정란들 중에 A형질을 가진 개체의 수 , B형질을 가진 개체의 수입니다#1'

        '이제 수정란은 성장하고 일부는 살아남을 것입니다#1'

        'V(A), V(B)는 각각 A, B형질을 가진 개체가 성체가 될 때까지 살아남을 확률입니다#1'

        '에를 들어 V(A)가 0.5하면 A형질을 가진 수정란의 절반이 성체가 됩니다#1'


        '번식을 할 수 있는 성체들 중 A의 비율은 다음과 같습니다#1'

        '이 모델에서 성체들은 형질에 상관없이 모두 혼자서 무성생식을 하며 z개의 수정란을 만듭니다#1'

        '이 가정하에 p'' 는 t+1시점에서 A형질 수정란의 비율이라고 하겠습니다#1'







        '이런 형태를 수학에서는 재귀 recusion이라고 부릅니다#1'

        '재귀는 자신을 정의할 때 자기 자신을 재참조하는 방법이라는 뜻입니다#1'

        '이제 앞으로 매 세대마다 p가 어떻게 변화하는  알 수 있습니다#1'

        '1세대에서의 p를매우복잡한 수식이다이라고 하겠습니다#1'

        '매우복잡한 수식이다는 다음과 같습니다#1'

        '그리고매우복잡한 수식이다는 똑같이매우복잡한 수식이다자리에 매우복잡한 수식이다를 넣어주면 구할 수 있습니다#1'

        '그리고 더 멋지게 표현하자면 미분방정식을 사용할 수 있습니다#1'

        '미분방정식은 다음 식에서 -p에 pV(A)+(1-p)V(B)를 곱해줘 통분을 하고 계산하면 다음과 같이 나옵니다#1'
        '일반적으로 분모부분 매우복잡한 수식이다로 표현합니다#1'

        '이 부분은 개체군 내 평균 적합도를 의미합니다#1'

        '이제 깔끔하게 표현하면 다음과 같이 됩니다#1'


        '이 미분방정식은 생존도에 따른 선택의 복제자 동학이라고 불리웁니다#1'

        '앞으로 매우 많이 보게 될 것이기 때문에 정확하게 이해하고 넘어가야합니다#1'

        '첫번째 p(1-p)는 개체군 내 형질의 분산입니다#1'

        '이항분포를 따르기 때문에 p(1-p)입니다#1'

        '둘 중 한 형질이 만연할 때 p(1-p)는 작아집니다#1'

        '분산은 두 형질이 반반(p=0.5) 있을 때 가장 커집니다#1'

        '이것은 자연선택이 분산이 최대일 때 최대로 일어난다는 것입니다#1'

        '자연선택은 도태의 과정이기도 합니다#1'

        '도태시킬 개체들이 가장 많을 때 변화는 빠르게 일어납니다#1'

        '끝에는 분산이 0이 되면 즉, p(1-p)=0이면 델타p가 0이 되면서#1'

        '세대를 거듭해도 아무것도 바뀌지 않는 상태가 됩니다#1'

        'p(1-p)=0 이라는 것은 p가 0 또는 1이라는 것인데 한 개체군이 한가지 형질로만 구성된 상태인 것입니다#1'

        '두번째 부분은매우복잡한 수식이다는 단순히 A형질이 B형에 비해 얼마나 증감하는지 나타낸 비입니다#1'

        'A가 B보다 더 잘 적응하는 형질이라면매우복잡한 수식이다는 0보다 클 것이고 세대를 거치면서 형질에 분산이 남아있는한 p(1-p)은0 p는 증가할 것입니다#1'

        '반대로  매우복잡한 수식이다다가 0보다 작다면 세대마다 점점 p는 감소할 것입니다#1'



        '추가적으로 각 형질이 단순히 생존도만 다른게 아니라 생산하는 수정란 수도 다른 경우를 보겠습니다#1'


        '아까 봤던 다음 세대 수정란의 수 공식에서 수정란 수를 곱해주면 됩니다#1'

        '그리고 수정란의 영향도 전부 적합도로 뭉뚱그려서 다음과 같이 표현할 수도 있다#1'

              , keep_pitch=True, update=1, speed=1.4)

        self.wait(5)




