'혹시 수학을 공부해야 하나요?#1'
'복잡한 수식이 수학공부를 방해하고 수학 수식만 보면 머리가 아파오나요?#1'
'비쥬얼 스템은 이런 문제를 시각화를 통해 해결하고 STEM 분야의 지식에 대한 다각화된 접근을 위한 프로젝트입니다#1'

'문제정의, 프로젝트 설명, 결론 순으로 영상을 진행하겟습니다#1'

'문제를 해결하기 위해서는 문제를 정확하게 정의하는 것이 먼저입니다#1'
'현재 어떤 사람들이 수학공부를 하고 어던 문제를 겪을까요#1'
'4차 산업으로 STEM 분야의 수학의 중요성이 날이 가면 갈수록 커지고 있습니다#1'
'따라서 성인들도 고등학교 이후로 손을 놨던 수학을 다시 공부하는 경우가 많아지고 있습니다#1'

'당연히 입시를 준비하는 학생들도 이 순간에도 수학책 앞에서 씨름 중입니다#1'
'그러나 모든 사람들이 수학에 흥미를 붙이고 쉽고 재미있게 공부하지 않는다는 것도 자명합니다#1'
'여기에는 다양한 이유가 있을 것입니다#1'

'첫째로 흥미와 역량의 문제가 잇습니다#1'
'흥미와 역량의 관계는 딱 잘라 정의내리기 어려운 문제이지만 둘 다 실재하고 해결돼야합니다#1'
'수학을 학습하면서 흥미를 느끼지 못 하는 경우, 흥미를 느낌에도 인지적 역량부족으로 어려움을 겪는 경우는 분명 존재합니다#1'

'둘째로 시대적 환경적 요인이 있습니다#1'
'한국 교과서는 다른 국가의 교과서에 비해 체험이나 시각화나 실생활의 예보다는 언어를 통해 딱딱하게 설명하는 편이어서 언어능력과 추상적 사고를 요합니다#1'
'그러나 디지털 세대는 책을 안 읽고 미디어 노출이 늘어서 언어능력이 부족해지고 있씁니다#1'
'또 자극적인 미디어 노출로 어텐션 스팬이 짧아지고 흥미 유발이 어려워짐#1'
'그리고 점점 더 참여적인 매체보다는 수동적인 매체에 익숙해졌습니다#1'

'셋째로 경제적 문제가 있습니다#1'
'위와 같은 문제를 해결하기 위해 비용을 지불해야 하는데 개인의 경제적 수준에 따라서 교육격차가 크게 벌어지는 경우를 목격합니다#1'

'이와 같은 문제를 해결하기 위해 대부분 다음과 같은 방법을 선택합니다#1'

'과외 및 학원은 전통적으로 가장 많이 사용된느 방법입니다.#1'
'그러나 사람을 고용함으로 비용이 비싸지고 공급에 한계가 있어서 모든 사람들이 돈이 있더라도 과외를 구할 수 없다는 문제가 있습니다. #1'

'인터넷 강의는 최초 생산이후 배포 및 전파가 자유로워 과외나 학원보다 가격이 많이 내려갔지만 요즘 고액인강으로 양극화가 일어나고 인강 가격에도 부담을 느끼는 사람이 여전히 많습니다#1'
'또한 인강은 양질의 강의를 제공하지만 상호작용이 없어 피드백이 원활하지 않다는 것이 특징입니다 #1'

'과외와 학원, 인터넷 강의의 공통점으로는 일반적으로 판서, 글, 삽화 등만을 자료 활용에서 여전히 아쉬움이 남는다는 것입니다#1'

'인터랙티브 매체#1'
'기술의 발전으로 최근 인터랙티브 방싞의 새로운 형태의 학습매체가 등장했스빈다. 지오지브라 데즈모스 등은 자신이 직접 그래프를 그리고 그것을 조절하며 실시간 변화를 눈으로 확인하고 시각화를 통해 새로운 방식으로 접근하기 때문에 이해에 도움이 많이 됩니다. 가격도 일반적으로 무료거나 저렴해 경제적인 문제도 없습니다. 그러나 프로그램을 다루기 위한 최소한의 흥미, 지식을 요구하고 직접 조작할 것을 요구합니다#1'

'넘버파일, 쓰리비원비, 베리타시움 등의 채널은 어려운 개념을 시각화 하고 디지털 세대의 흥미를 끌 수 있는 영상효과와 연출, 접근성 좋은 플랫폼인 유튜브를 통해 STEM분야의 대중화에 많은 기여를 했습니다#1'
'그러나 지금까지 대부분 지엽적이거나 기초수학 단계를 넘어선 어려운 주제를 더 쉽게 전달하기 위한 것이 많았습니다. #1'
'칸 아카데미와 같은 무료 열린 교육 시도도 있었지만 한국교육과정과 일치하지 않아 한국인들의 이용유인이 적었습니다#1'
'모바일을 활용해 브릴리언트같은 앱이 깔끔한 애니메이션과 저렴한 가격을 내세웠지만 디지털 세대가 익숙한 수동적 매체이기 보다는 직접 스크롤, 클릭하고 문제를 푸는 방식을 벗어나지 않아 학습자체에 흥미가 없는 이에겐 선생님이 계속 질문과 참여를 강요하는 일반 수업의 디지털 버전으로만 느껴집니다#1'

'무엇보다 위 매체들의 가장 큰 문제는 영어였습니다#1'
'영어를 편하게 사용할 수 없다면 애니메이션을 통한 지식 습듯에 한계가 있습니다#1'
'당장 2의 4승의 x승, 3의 세제곱근, 최대 공배수, ~은 ~의 원소이다, 등비급수, 삼각함수, 합동을 이룬다, 복소수의 실수부, 자연상수 등을 영어로 떠올리려 해도 한국어로도 수학을 처음배우는 사람들에게는 낯선 단어이니 생각이 나지 않고 영어로 들어도 이해될리가 만무합니다 #1'
'the complex conjugate of one minus two i equals one plus two i, one minus three over two plus four equals minus one third, the fifth root of thirty two, product of b for from one to infinity를 들어도 머릿속에 그려지시나요?#1'

'위의 4가지 방법이 있는 지금 수학을 어려워하는 사람의 문제가 모두 해결됐나요?#1'
'우리는 여전히 수학에 어려움을 겪는 사람이 있다는 것을 압니다#1'
'그러니 여전히 개선의 여지가 있고 문제를 해결하기 위한 다양한 시도와 노력을 멈추면 안됩니다#1'

'비주얼 스템 프로젝트는 위 문제를 해결하기 위해서 스템의 기초인 수학부터 한국의 교과과정에 맞게 영어가 아닌 한국어로 제작하고 더욱 다양하고 심화된 STeM 분야의 교육 영상을 제공하는 것이 목표입니다.#1'

'프로젝트의 장점을 소개하겠습니다#1'
'수학을 하면서 가장 어려운 점이라면 머릿속에 개념이 잘 안 들어온다는 것입니다#1'
'아래는 실제 교육 일선 현장에서 학생들이 겪는 인지적 어려움입니다#1'
'그리고 이러한 경우 시각화가 큰 도움이 될 수가 있습니다#1'
'움직이지 않는 이미지보다 실시간으로 살아움직이는 애니메이션과 다양한 각도에서 바라봄으러써 이러한 문제를 해결하려고 합니다#1'

'수학영상용 라이브러리를 활용하여 프로그래밍으로만 벡터 그래픽 영상을 만들기 때문에 자동화를 하는 것이 많을 경우, 스케일이 클 경우, 시각적인 정교함이 필요한 경우 적합합니다#1'

'보완점으로는 수동적 매체라는 점에서 교육효과가 다소 떨어질 수도 있습니다#1'
'이에 대한 보완으로는 예제, 증명, 실생활에 개념이 적용되는 예시  등 이해를 위한 접근을 최대한 다양한 방식으로 제작하여A증명을 이해 못 해도 B증명으로, B증명을 이해 못 해도 실생활의 예시를 보고 이해할 수 있게 하는 것입니다#1'
'또한 교육 일선에 있는 교육자들의 의견을 적극 수렴하는 것도 방안입니다#1'
'개념의 시각화가 잘 이루어지지 않으면 매체의 장점을 제대로 활용하지 못 할 수도 있습니다#1'
'이또한 단순히 판서강의와 그림을 애니메이션으로 만들 교육자가 아니라 매체의 특성을 정확하게 이해하고 시각화에 능한 교육자를 섭외함으로써 해결할 것입니다. #1'
'컨텐츠와 영상화 사이의 협조가 안 될 경우 결과물이 좋지 않을 수도 있습니다#1'
'이것은 영상제작팀과 컨텐츠기획팀 간의 충분한 회의와 언제나 강의내용을 우선시 하는 제작방식으로 방지할 것이빈다#1'

'향후 계획으로는 수학적 배경이 충분할 경우 유리한 컴퓨터 공학, 물리, 수리생물학, 게임이론, 경제 등의 영상도 타분야 전문가를 섭외해 제작 예정입니다#1'
'또한 교재 출판과 영상매체를 연계해 도서에 큐알코드로 영상을 링크하여 활용할 수도 있습니다#1'
'마지막으로 단순 수학 개념강의와 함꼐 심화된 주제나 수능기출과 같은 수요가 높은 주제를 시각화를 통해 새롭게 접근할 수 있을 것입니다#1'

'결론을 내자면 한국 수학 교과과정에 맞춘 한국어 컨텐츠를 만듦으로써 그동안 기존 방안들로 해결되지 않았던 공백의 일부를 해소할 가능성이 있다는 것입니다#1'
'또한 수학의 기초를 쌓은 뒤 STEM분야 전문가들과의 협업을 통해 스템분야에 대중들이 좀 더 쉽게 다가가게 할 수 있습니다#1'
